GopalSaraf/Practicals/PSDL/include/proc/pic16f18876.inc
// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 0098h
// bitfield definitions
ADCLK_ADCCS_POSN                         equ 0000h
ADCLK_ADCCS_POSITION                     equ 0000h
ADCLK_ADCCS_SIZE                         equ 0006h
ADCLK_ADCCS_LENGTH                       equ 0006h
ADCLK_ADCCS_MASK                         equ 003Fh
ADCLK_ADCCS0_POSN                        equ 0000h
ADCLK_ADCCS0_POSITION                    equ 0000h
ADCLK_ADCCS0_SIZE                        equ 0001h
ADCLK_ADCCS0_LENGTH                      equ 0001h
ADCLK_ADCCS0_MASK                        equ 0001h
ADCLK_ADCCS1_POSN                        equ 0001h
ADCLK_ADCCS1_POSITION                    equ 0001h
ADCLK_ADCCS1_SIZE                        equ 0001h
ADCLK_ADCCS1_LENGTH                      equ 0001h
ADCLK_ADCCS1_MASK                        equ 0002h
ADCLK_ADCCS2_POSN                        equ 0002h
ADCLK_ADCCS2_POSITION                    equ 0002h
ADCLK_ADCCS2_SIZE                        equ 0001h
ADCLK_ADCCS2_LENGTH                      equ 0001h
ADCLK_ADCCS2_MASK                        equ 0004h
ADCLK_ADCCS3_POSN                        equ 0003h
ADCLK_ADCCS3_POSITION                    equ 0003h
ADCLK_ADCCS3_SIZE                        equ 0001h
ADCLK_ADCCS3_LENGTH                      equ 0001h
ADCLK_ADCCS3_MASK                        equ 0008h
ADCLK_ADCCS4_POSN                        equ 0004h
ADCLK_ADCCS4_POSITION                    equ 0004h
ADCLK_ADCCS4_SIZE                        equ 0001h
ADCLK_ADCCS4_LENGTH                      equ 0001h
ADCLK_ADCCS4_MASK                        equ 0010h
ADCLK_ADCCS5_POSN                        equ 0005h
ADCLK_ADCCS5_POSITION                    equ 0005h
ADCLK_ADCCS5_SIZE                        equ 0001h
ADCLK_ADCCS5_LENGTH                      equ 0001h
ADCLK_ADCCS5_MASK                        equ 0020h

// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 0099h
// bitfield definitions
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0005h
ADACT_ADACT_LENGTH                       equ 0005h
ADACT_ADACT_MASK                         equ 001Fh
ADACT_ADACT0_POSN                        equ 0000h
ADACT_ADACT0_POSITION                    equ 0000h
ADACT_ADACT0_SIZE                        equ 0001h
ADACT_ADACT0_LENGTH                      equ 0001h
ADACT_ADACT0_MASK                        equ 0001h
ADACT_ADACT1_POSN                        equ 0001h
ADACT_ADACT1_POSITION                    equ 0001h
ADACT_ADACT1_SIZE                        equ 0001h
ADACT_ADACT1_LENGTH                      equ 0001h
ADACT_ADACT1_MASK                        equ 0002h
ADACT_ADACT2_POSN                        equ 0002h
ADACT_ADACT2_POSITION                    equ 0002h
ADACT_ADACT2_SIZE                        equ 0001h
ADACT_ADACT2_LENGTH                      equ 0001h
ADACT_ADACT2_MASK                        equ 0004h
ADACT_ADACT3_POSN                        equ 0003h
ADACT_ADACT3_POSITION                    equ 0003h
ADACT_ADACT3_SIZE                        equ 0001h
ADACT_ADACT3_LENGTH                      equ 0001h
ADACT_ADACT3_MASK                        equ 0008h
ADACT_ADACT4_POSN                        equ 0004h
ADACT_ADACT4_POSITION                    equ 0004h
ADACT_ADACT4_SIZE                        equ 0001h
ADACT_ADACT4_LENGTH                      equ 0001h
ADACT_ADACT4_MASK                        equ 0010h

// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 009Ah
// bitfield definitions
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0002h
ADREF_ADPREF_LENGTH                      equ 0002h
ADREF_ADPREF_MASK                        equ 0003h
ADREF_ADNREF_POSN                        equ 0004h
ADREF_ADNREF_POSITION                    equ 0004h
ADREF_ADNREF_SIZE                        equ 0001h
ADREF_ADNREF_LENGTH                      equ 0001h
ADREF_ADNREF_MASK                        equ 0010h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h

// Register: ADCAP
#define ADCAP ADCAP
ADCAP                                    equ 009Bh
// bitfield definitions
ADCAP_ADCAP_POSN                         equ 0000h
ADCAP_ADCAP_POSITION                     equ 0000h
ADCAP_ADCAP_SIZE                         equ 0005h
ADCAP_ADCAP_LENGTH                       equ 0005h
ADCAP_ADCAP_MASK                         equ 001Fh
ADCAP_ADCAP0_POSN                        equ 0000h
ADCAP_ADCAP0_POSITION                    equ 0000h
ADCAP_ADCAP0_SIZE                        equ 0001h
ADCAP_ADCAP0_LENGTH                      equ 0001h
ADCAP_ADCAP0_MASK                        equ 0001h
ADCAP_ADCAP1_POSN                        equ 0001h
ADCAP_ADCAP1_POSITION                    equ 0001h
ADCAP_ADCAP1_SIZE                        equ 0001h
ADCAP_ADCAP1_LENGTH                      equ 0001h
ADCAP_ADCAP1_MASK                        equ 0002h
ADCAP_ADCAP2_POSN                        equ 0002h
ADCAP_ADCAP2_POSITION                    equ 0002h
ADCAP_ADCAP2_SIZE                        equ 0001h
ADCAP_ADCAP2_LENGTH                      equ 0001h
ADCAP_ADCAP2_MASK                        equ 0004h
ADCAP_ADCAP3_POSN                        equ 0003h
ADCAP_ADCAP3_POSITION                    equ 0003h
ADCAP_ADCAP3_SIZE                        equ 0001h
ADCAP_ADCAP3_LENGTH                      equ 0001h
ADCAP_ADCAP3_MASK                        equ 0008h
ADCAP_ADCAP4_POSN                        equ 0004h
ADCAP_ADCAP4_POSITION                    equ 0004h
ADCAP_ADCAP4_SIZE                        equ 0001h
ADCAP_ADCAP4_LENGTH                      equ 0001h
ADCAP_ADCAP4_MASK                        equ 0010h

// Register: ADPRE
#define ADPRE ADPRE
ADPRE                                    equ 009Ch
// bitfield definitions
ADPRE_ADPRE_POSN                         equ 0000h
ADPRE_ADPRE_POSITION                     equ 0000h
ADPRE_ADPRE_SIZE                         equ 0008h
ADPRE_ADPRE_LENGTH                       equ 0008h
ADPRE_ADPRE_MASK                         equ 00FFh
ADPRE_ADPRE0_POSN                        equ 0000h
ADPRE_ADPRE0_POSITION                    equ 0000h
ADPRE_ADPRE0_SIZE                        equ 0001h
ADPRE_ADPRE0_LENGTH                      equ 0001h
ADPRE_ADPRE0_MASK                        equ 0001h
ADPRE_ADPRE1_POSN                        equ 0001h
ADPRE_ADPRE1_POSITION                    equ 0001h
ADPRE_ADPRE1_SIZE                        equ 0001h
ADPRE_ADPRE1_LENGTH                      equ 0001h
ADPRE_ADPRE1_MASK                        equ 0002h
ADPRE_ADPRE2_POSN                        equ 0002h
ADPRE_ADPRE2_POSITION                    equ 0002h
ADPRE_ADPRE2_SIZE                        equ 0001h
ADPRE_ADPRE2_LENGTH                      equ 0001h
ADPRE_ADPRE2_MASK                        equ 0004h
ADPRE_ADPRE3_POSN                        equ 0003h
ADPRE_ADPRE3_POSITION                    equ 0003h
ADPRE_ADPRE3_SIZE                        equ 0001h
ADPRE_ADPRE3_LENGTH                      equ 0001h
ADPRE_ADPRE3_MASK                        equ 0008h
ADPRE_ADPRE4_POSN                        equ 0004h
ADPRE_ADPRE4_POSITION                    equ 0004h
ADPRE_ADPRE4_SIZE                        equ 0001h
ADPRE_ADPRE4_LENGTH                      equ 0001h
ADPRE_ADPRE4_MASK                        equ 0010h
ADPRE_ADPRE5_POSN                        equ 0005h
ADPRE_ADPRE5_POSITION                    equ 0005h
ADPRE_ADPRE5_SIZE                        equ 0001h
ADPRE_ADPRE5_LENGTH                      equ 0001h
ADPRE_ADPRE5_MASK                        equ 0020h
ADPRE_ADPRE6_POSN                        equ 0006h
ADPRE_ADPRE6_POSITION                    equ 0006h
ADPRE_ADPRE6_SIZE                        equ 0001h
ADPRE_ADPRE6_LENGTH                      equ 0001h
ADPRE_ADPRE6_MASK                        equ 0040h
ADPRE_ADPRE7_POSN                        equ 0007h
ADPRE_ADPRE7_POSITION                    equ 0007h
ADPRE_ADPRE7_SIZE                        equ 0001h
ADPRE_ADPRE7_LENGTH                      equ 0001h
ADPRE_ADPRE7_MASK                        equ 0080h

// Register: ADACQ
#define ADACQ ADACQ
ADACQ                                    equ 009Dh
// bitfield definitions
ADACQ_ADACQ_POSN                         equ 0000h
ADACQ_ADACQ_POSITION                     equ 0000h
ADACQ_ADACQ_SIZE                         equ 0008h
ADACQ_ADACQ_LENGTH                       equ 0008h
ADACQ_ADACQ_MASK                         equ 00FFh
ADACQ_ADACQ0_POSN                        equ 0000h
ADACQ_ADACQ0_POSITION                    equ 0000h
ADACQ_ADACQ0_SIZE                        equ 0001h
ADACQ_ADACQ0_LENGTH                      equ 0001h
ADACQ_ADACQ0_MASK                        equ 0001h
ADACQ_ADACQ1_POSN                        equ 0001h
ADACQ_ADACQ1_POSITION                    equ 0001h
ADACQ_ADACQ1_SIZE                        equ 0001h
ADACQ_ADACQ1_LENGTH                      equ 0001h
ADACQ_ADACQ1_MASK                        equ 0002h
ADACQ_ADACQ2_POSN                        equ 0002h
ADACQ_ADACQ2_POSITION                    equ 0002h
ADACQ_ADACQ2_SIZE                        equ 0001h
ADACQ_ADACQ2_LENGTH                      equ 0001h
ADACQ_ADACQ2_MASK                        equ 0004h
ADACQ_ADACQ3_POSN                        equ 0003h
ADACQ_ADACQ3_POSITION                    equ 0003h
ADACQ_ADACQ3_SIZE                        equ 0001h
ADACQ_ADACQ3_LENGTH                      equ 0001h
ADACQ_ADACQ3_MASK                        equ 0008h
ADACQ_ADACQ4_POSN                        equ 0004h
ADACQ_ADACQ4_POSITION                    equ 0004h
ADACQ_ADACQ4_SIZE                        equ 0001h
ADACQ_ADACQ4_LENGTH                      equ 0001h
ADACQ_ADACQ4_MASK                        equ 0010h
ADACQ_ADACQ5_POSN                        equ 0005h
ADACQ_ADACQ5_POSITION                    equ 0005h
ADACQ_ADACQ5_SIZE                        equ 0001h
ADACQ_ADACQ5_LENGTH                      equ 0001h
ADACQ_ADACQ5_MASK                        equ 0020h
ADACQ_ADACQ6_POSN                        equ 0006h
ADACQ_ADACQ6_POSITION                    equ 0006h
ADACQ_ADACQ6_SIZE                        equ 0001h
ADACQ_ADACQ6_LENGTH                      equ 0001h
ADACQ_ADACQ6_MASK                        equ 0040h
ADACQ_ADACQ7_POSN                        equ 0007h
ADACQ_ADACQ7_POSITION                    equ 0007h
ADACQ_ADACQ7_SIZE                        equ 0001h
ADACQ_ADACQ7_LENGTH                      equ 0001h
ADACQ_ADACQ7_MASK                        equ 0080h

