GopalSaraf/Practicals/PSDL/include/proc/pic16f18876.inc
// Register: CCDNC
#define CCDNC CCDNC
CCDNC                                    equ 0F56h
// bitfield definitions
CCDNC_CCDNC0_POSN                        equ 0000h
CCDNC_CCDNC0_POSITION                    equ 0000h
CCDNC_CCDNC0_SIZE                        equ 0001h
CCDNC_CCDNC0_LENGTH                      equ 0001h
CCDNC_CCDNC0_MASK                        equ 0001h
CCDNC_CCDNC1_POSN                        equ 0001h
CCDNC_CCDNC1_POSITION                    equ 0001h
CCDNC_CCDNC1_SIZE                        equ 0001h
CCDNC_CCDNC1_LENGTH                      equ 0001h
CCDNC_CCDNC1_MASK                        equ 0002h
CCDNC_CCDNC2_POSN                        equ 0002h
CCDNC_CCDNC2_POSITION                    equ 0002h
CCDNC_CCDNC2_SIZE                        equ 0001h
CCDNC_CCDNC2_LENGTH                      equ 0001h
CCDNC_CCDNC2_MASK                        equ 0004h
CCDNC_CCDNC3_POSN                        equ 0003h
CCDNC_CCDNC3_POSITION                    equ 0003h
CCDNC_CCDNC3_SIZE                        equ 0001h
CCDNC_CCDNC3_LENGTH                      equ 0001h
CCDNC_CCDNC3_MASK                        equ 0008h
CCDNC_CCDNC4_POSN                        equ 0004h
CCDNC_CCDNC4_POSITION                    equ 0004h
CCDNC_CCDNC4_SIZE                        equ 0001h
CCDNC_CCDNC4_LENGTH                      equ 0001h
CCDNC_CCDNC4_MASK                        equ 0010h
CCDNC_CCDNC5_POSN                        equ 0005h
CCDNC_CCDNC5_POSITION                    equ 0005h
CCDNC_CCDNC5_SIZE                        equ 0001h
CCDNC_CCDNC5_LENGTH                      equ 0001h
CCDNC_CCDNC5_MASK                        equ 0020h
CCDNC_CCDNC6_POSN                        equ 0006h
CCDNC_CCDNC6_POSITION                    equ 0006h
CCDNC_CCDNC6_SIZE                        equ 0001h
CCDNC_CCDNC6_LENGTH                      equ 0001h
CCDNC_CCDNC6_MASK                        equ 0040h
CCDNC_CCDNC7_POSN                        equ 0007h
CCDNC_CCDNC7_POSITION                    equ 0007h
CCDNC_CCDNC7_SIZE                        equ 0001h
CCDNC_CCDNC7_LENGTH                      equ 0001h
CCDNC_CCDNC7_MASK                        equ 0080h

// Register: CCDPC
#define CCDPC CCDPC
CCDPC                                    equ 0F57h
// bitfield definitions
CCDPC_CCDPC0_POSN                        equ 0000h
CCDPC_CCDPC0_POSITION                    equ 0000h
CCDPC_CCDPC0_SIZE                        equ 0001h
CCDPC_CCDPC0_LENGTH                      equ 0001h
CCDPC_CCDPC0_MASK                        equ 0001h
CCDPC_CCDPC1_POSN                        equ 0001h
CCDPC_CCDPC1_POSITION                    equ 0001h
CCDPC_CCDPC1_SIZE                        equ 0001h
CCDPC_CCDPC1_LENGTH                      equ 0001h
CCDPC_CCDPC1_MASK                        equ 0002h
CCDPC_CCDPC2_POSN                        equ 0002h
CCDPC_CCDPC2_POSITION                    equ 0002h
CCDPC_CCDPC2_SIZE                        equ 0001h
CCDPC_CCDPC2_LENGTH                      equ 0001h
CCDPC_CCDPC2_MASK                        equ 0004h
CCDPC_CCDPC3_POSN                        equ 0003h
CCDPC_CCDPC3_POSITION                    equ 0003h
CCDPC_CCDPC3_SIZE                        equ 0001h
CCDPC_CCDPC3_LENGTH                      equ 0001h
CCDPC_CCDPC3_MASK                        equ 0008h
CCDPC_CCDPC4_POSN                        equ 0004h
CCDPC_CCDPC4_POSITION                    equ 0004h
CCDPC_CCDPC4_SIZE                        equ 0001h
CCDPC_CCDPC4_LENGTH                      equ 0001h
CCDPC_CCDPC4_MASK                        equ 0010h
CCDPC_CCDPC5_POSN                        equ 0005h
CCDPC_CCDPC5_POSITION                    equ 0005h
CCDPC_CCDPC5_SIZE                        equ 0001h
CCDPC_CCDPC5_LENGTH                      equ 0001h
CCDPC_CCDPC5_MASK                        equ 0020h
CCDPC_CCDPC6_POSN                        equ 0006h
CCDPC_CCDPC6_POSITION                    equ 0006h
CCDPC_CCDPC6_SIZE                        equ 0001h
CCDPC_CCDPC6_LENGTH                      equ 0001h
CCDPC_CCDPC6_MASK                        equ 0040h
CCDPC_CCDPC7_POSN                        equ 0007h
CCDPC_CCDPC7_POSITION                    equ 0007h
CCDPC_CCDPC7_SIZE                        equ 0001h
CCDPC_CCDPC7_LENGTH                      equ 0001h
CCDPC_CCDPC7_MASK                        equ 0080h

// Register: ANSELD
#define ANSELD ANSELD
ANSELD                                   equ 0F59h
// bitfield definitions
ANSELD_ANSD0_POSN                        equ 0000h
ANSELD_ANSD0_POSITION                    equ 0000h
ANSELD_ANSD0_SIZE                        equ 0001h
ANSELD_ANSD0_LENGTH                      equ 0001h
ANSELD_ANSD0_MASK                        equ 0001h
ANSELD_ANSD1_POSN                        equ 0001h
ANSELD_ANSD1_POSITION                    equ 0001h
ANSELD_ANSD1_SIZE                        equ 0001h
ANSELD_ANSD1_LENGTH                      equ 0001h
ANSELD_ANSD1_MASK                        equ 0002h
ANSELD_ANSD2_POSN                        equ 0002h
ANSELD_ANSD2_POSITION                    equ 0002h
ANSELD_ANSD2_SIZE                        equ 0001h
ANSELD_ANSD2_LENGTH                      equ 0001h
ANSELD_ANSD2_MASK                        equ 0004h
ANSELD_ANSD3_POSN                        equ 0003h
ANSELD_ANSD3_POSITION                    equ 0003h
ANSELD_ANSD3_SIZE                        equ 0001h
ANSELD_ANSD3_LENGTH                      equ 0001h
ANSELD_ANSD3_MASK                        equ 0008h
ANSELD_ANSD4_POSN                        equ 0004h
ANSELD_ANSD4_POSITION                    equ 0004h
ANSELD_ANSD4_SIZE                        equ 0001h
ANSELD_ANSD4_LENGTH                      equ 0001h
ANSELD_ANSD4_MASK                        equ 0010h
ANSELD_ANSD5_POSN                        equ 0005h
ANSELD_ANSD5_POSITION                    equ 0005h
ANSELD_ANSD5_SIZE                        equ 0001h
ANSELD_ANSD5_LENGTH                      equ 0001h
ANSELD_ANSD5_MASK                        equ 0020h
ANSELD_ANSD6_POSN                        equ 0006h
ANSELD_ANSD6_POSITION                    equ 0006h
ANSELD_ANSD6_SIZE                        equ 0001h
ANSELD_ANSD6_LENGTH                      equ 0001h
ANSELD_ANSD6_MASK                        equ 0040h
ANSELD_ANSD7_POSN                        equ 0007h
ANSELD_ANSD7_POSITION                    equ 0007h
ANSELD_ANSD7_SIZE                        equ 0001h
ANSELD_ANSD7_LENGTH                      equ 0001h
ANSELD_ANSD7_MASK                        equ 0080h

// Register: WPUD
#define WPUD WPUD
WPUD                                     equ 0F5Ah
// bitfield definitions
WPUD_WPUD0_POSN                          equ 0000h
WPUD_WPUD0_POSITION                      equ 0000h
WPUD_WPUD0_SIZE                          equ 0001h
WPUD_WPUD0_LENGTH                        equ 0001h
WPUD_WPUD0_MASK                          equ 0001h
WPUD_WPUD1_POSN                          equ 0001h
WPUD_WPUD1_POSITION                      equ 0001h
WPUD_WPUD1_SIZE                          equ 0001h
WPUD_WPUD1_LENGTH                        equ 0001h
WPUD_WPUD1_MASK                          equ 0002h
WPUD_WPUD2_POSN                          equ 0002h
WPUD_WPUD2_POSITION                      equ 0002h
WPUD_WPUD2_SIZE                          equ 0001h
WPUD_WPUD2_LENGTH                        equ 0001h
WPUD_WPUD2_MASK                          equ 0004h
WPUD_WPUD3_POSN                          equ 0003h
WPUD_WPUD3_POSITION                      equ 0003h
WPUD_WPUD3_SIZE                          equ 0001h
WPUD_WPUD3_LENGTH                        equ 0001h
WPUD_WPUD3_MASK                          equ 0008h
WPUD_WPUD4_POSN                          equ 0004h
WPUD_WPUD4_POSITION                      equ 0004h
WPUD_WPUD4_SIZE                          equ 0001h
WPUD_WPUD4_LENGTH                        equ 0001h
WPUD_WPUD4_MASK                          equ 0010h
WPUD_WPUD5_POSN                          equ 0005h
WPUD_WPUD5_POSITION                      equ 0005h
WPUD_WPUD5_SIZE                          equ 0001h
WPUD_WPUD5_LENGTH                        equ 0001h
WPUD_WPUD5_MASK                          equ 0020h
WPUD_WPUD6_POSN                          equ 0006h
WPUD_WPUD6_POSITION                      equ 0006h
WPUD_WPUD6_SIZE                          equ 0001h
WPUD_WPUD6_LENGTH                        equ 0001h
WPUD_WPUD6_MASK                          equ 0040h
WPUD_WPUD7_POSN                          equ 0007h
WPUD_WPUD7_POSITION                      equ 0007h
WPUD_WPUD7_SIZE                          equ 0001h
WPUD_WPUD7_LENGTH                        equ 0001h
WPUD_WPUD7_MASK                          equ 0080h

